Repository: nakafaai/nakafa-prayer
Catalog: Sources/NakafaPrayerCore/Resources/Localizable.xcstrings
Source language: en
Languages: id

# action.apply_location
source: Apply Location
id: Terapkan Lokasi

# action.enable_notifications
source: Enable Notifications
id: Aktifkan Notifikasi

# action.open_location_settings
source: Open Location Settings
id: Buka Pengaturan Lokasi

# action.open_login_items
source: Open Login Items
id: Buka Item Masuk

# action.open_notification_settings
source: Open Notification Settings
id: Buka Pengaturan Notifikasi

# action.retry_scheduling
source: Retry Scheduling
id: Coba Jadwalkan Lagi

# action.use_current_location
source: Use Current Location
id: Gunakan Lokasi Saat Ini

# app.calculation_summary
source: %@ · Asr %@
id: %@ · Asar %@

# app.check_for_updates
source: Check for Updates…
id: Periksa Pembaruan…

# app.location_automatic_coordinates
source: Automatic: %.2f, %.2f
id: Otomatis: %.2f, %.2f

# app.next_prayer
source: Next: %@ at %@
id: Berikutnya: %@ pukul %@

# app.next_prayer_accessibility
source: Next prayer, %@ at %@
id: Salat berikutnya, %@ pukul %@

# app.prayer_time_accessibility
source: %@ at %@
id: %@ pukul %@

# app.quit
source: Quit
id: Keluar

# app.refresh_location
source: Refresh Location
id: Perbarui Lokasi

# app.settings
source: Settings
id: Pengaturan

# app.today_prayer_times
source: Today
id: Hari ini

# app.tomorrow_prayer_times
source: Tomorrow
id: Besok

# focus.cancel
source: Cancel
id: Batal

# focus.consent_message
source: Focus Mode will cover every connected display for %d minutes when Nakafa Prayer is running. It starts automatically at prayer time, may start up to 5 minutes after wake, and can always be ended with its button or Escape. App switching remains available.
id: Mode Fokus akan menutupi setiap layar yang terhubung selama %d menit ketika Nakafa Prayer berjalan. Mode ini dimulai otomatis pada waktu salat, dapat dimulai hingga 5 menit setelah Mac bangun, dan selalu dapat diakhiri dengan tombolnya atau Escape. Pergantian aplikasi tetap tersedia.

# focus.consent_title
source: Enable Focus Mode?
id: Aktifkan Mode Fokus?

# focus.countdown
source: %@ remaining
id: Sisa %@

# focus.enable
source: Enable Focus Mode
id: Aktifkan Mode Fokus

# focus.end
source: End Focus Mode
id: Akhiri Mode Fokus

# focus.end_confirmation_message
source: Prayer focus will end on every display.
id: Fokus salat akan berakhir di setiap layar.

# focus.end_confirmation_title
source: End Focus Mode?
id: Akhiri Mode Fokus?

# focus.end_hint
source: Shows a confirmation before ending Focus Mode. You can also press Escape.
id: Menampilkan konfirmasi sebelum mengakhiri Mode Fokus. Anda juga dapat menekan Escape.

# focus.help
source: Optional full-screen prayer prompt while the app is running. Notifications remain the reliable reminder channel.
id: Pengingat salat layar penuh opsional ketika aplikasi berjalan. Notifikasi tetap menjadi saluran pengingat yang andal.

# focus.message
source: Pause, step away, and pray when you are ready.
id: Berhenti sejenak, tinggalkan layar, dan salat ketika Anda siap.

# focus.preview
source: Preview Focus Mode
id: Pratinjau Mode Fokus

# focus.title
source: Time for %@ prayer
id: Waktunya salat %@

# language.en
source: English
id: Inggris

# language.id
source: Indonesian
id: Indonesia

# language.system
source: System
id: Sistem

# location.automatic
source: Automatic
id: Otomatis

# madhab.shafi
source: Shafi
id: Syafii

# method.egyptian
source: Egyptian Survey
id: Survei Mesir

# method.moonsightingCommittee
source: Moonsighting Committee
id: Komite Pengamatan Bulan

# method.muslimWorldLeague
source: Muslim World League
id: Liga Muslim Dunia

# method.northAmerica
source: North America
id: Amerika Utara

# method.singapore
source: Singapore, Malaysia, Indonesia
id: Singapura, Malaysia, Indonesia

# method.tehran
source: Tehran
id: Teheran

# method.turkey
source: Turkey
id: Turki

# notification.body
source: It is time to pause and pray.
id: Saatnya berhenti sejenak dan salat.

# notification.title
source: %@ prayer
id: Salat %@

# prayer.asr
source: Asr
id: Asar

# prayer.dhuhr
source: Dhuhr
id: Zuhur

# prayer.fajr
source: Fajr
id: Subuh

# prayer.isha
source: Isha
id: Isya

# prayer.maghrib
source: Maghrib
id: Magrib

# settings.adhan
source: Play the bundled adhan alert
id: Putar pengingat adzan bawaan

# settings.calculation
source: Calculation
id: Perhitungan

# settings.calculation_method
source: Method
id: Metode

# settings.focus_duration
source: Duration
id: Durasi

# settings.focus_mode
source: Focus Mode
id: Mode Fokus

# settings.general
source: General
id: Umum

# settings.language
source: Language
id: Bahasa

# settings.latitude
source: Latitude
id: Lintang

# settings.launch_at_login
source: Launch at login
id: Buka saat masuk

# settings.location
source: Location
id: Lokasi

# settings.location_label
source: Optional local label
id: Label lokal opsional

# settings.location_mode
source: Location source
id: Sumber lokasi

# settings.location_privacy_help
source: Coordinates stay on this Mac. Nakafa Prayer does not look up or transmit place names.
id: Koordinat tetap di Mac ini. Nakafa Prayer tidak mencari atau mengirim nama tempat.

# settings.longitude
source: Longitude
id: Bujur

# settings.madhab
source: Asr madhab
id: Mazhab Asar

# settings.manual_location_help
source: Both coordinates are required. Typing does not change reminders until you apply them.
id: Kedua koordinat wajib diisi. Mengetik tidak mengubah pengingat sampai Anda menerapkannya.

# settings.minutes
source: %d min
id: %d menit

# settings.preview_adhan
source: Preview adhan alert
id: Pratinjau pengingat adzan

# settings.reminder
source: Reminder
id: Pengingat

# settings.reminder_help
source: Local notifications deliver prayer reminders while the app is asleep or closed. Permission is requested only when you choose to enable them.
id: Notifikasi lokal mengirim pengingat salat saat aplikasi tertidur atau ditutup. Izin hanya diminta ketika Anda memilih untuk mengaktifkannya.

# settings.stop_adhan_preview
source: Stop preview
id: Hentikan pratinjau

# state.audio_unavailable
source: The bundled adhan alert is unavailable.
id: Pengingat adzan bawaan tidak tersedia.

# state.calculation_failed
source: Prayer times could not be calculated.
id: Waktu salat tidak dapat dihitung.

# state.location_available
source: Location is ready
id: Lokasi siap

# state.location_cache_save_failed
source: The automatic location could not be saved locally
id: Lokasi otomatis tidak dapat disimpan secara lokal

# state.location_denied
source: Location access is denied
id: Akses lokasi ditolak

# state.location_failed
source: Current location is unavailable
id: Lokasi saat ini tidak tersedia

# state.location_invalid_manual
source: Enter a valid latitude and longitude
id: Masukkan lintang dan bujur yang valid

# state.location_not_configured
source: Set a location to calculate prayer times
id: Atur lokasi untuk menghitung waktu salat

# state.location_requesting
source: Getting current location…
id: Mengambil lokasi saat ini…

# state.location_requesting_permission
source: Waiting for location permission…
id: Menunggu izin lokasi…

# state.location_restricted
source: Location access is restricted
id: Akses lokasi dibatasi

# state.login_item_failed
source: Launch at login could not be updated.
id: Buka saat masuk tidak dapat diperbarui.

# state.login_item_requires_approval
source: Approval is required in Login Items.
id: Persetujuan diperlukan di Item Masuk.

# state.login_item_unavailable
source: Launch at login is available in the installed app.
id: Buka saat masuk tersedia di aplikasi yang terpasang.

# state.notifications_alerts_disabled
source: Notification alerts are disabled
id: Peringatan notifikasi dinonaktifkan

# state.notifications_authorization_failed
source: Notification permission could not be requested
id: Izin notifikasi tidak dapat diminta

# state.notifications_authorized
source: Reminders are active
id: Pengingat aktif

# state.notifications_denied
source: Reminders are inactive because notifications are denied
id: Pengingat tidak aktif karena notifikasi ditolak

# state.notifications_not_determined
source: Enable notifications for reliable reminders
id: Aktifkan notifikasi untuk pengingat yang andal

# state.notifications_scheduling_failed
source: Reminders could not be scheduled
id: Pengingat tidak dapat dijadwalkan

# state.notifications_sound_disabled
source: Reminders are active without sound
id: Pengingat aktif tanpa suara

# state.settings_recovered
source: Unreadable settings were reset to safe defaults.
id: Pengaturan yang tidak dapat dibaca telah diatur ulang ke bawaan yang aman.

# state.settings_save_failed
source: Settings could not be saved.
id: Pengaturan tidak dapat disimpan.
